{
  "experienceTimeline": [
    {
      "id": "sofomo-website",
      "company": "Sofomo",
      "project": "Sofomo Website",
      "visibility": "public",
      "url": "https://www.sofomo.com/",
      "location": "Poland / International",
      "startDate": "2022-03",
      "endDate": "2023-01",
      "role": "Front-end Developer",
      "shortDescription": "Built and maintained Sofomo's corporate website in Next.js with a focus on SEO, performance, and reusable UI components.",
      "longDescription": "Contributed to the development and ongoing maintenance of Sofomo's public-facing website using Next.js and React. Delivered responsive, accessible UI components aligned with brand guidelines, and supported SEO and performance improvements (routing, code-splitting, image optimization). Worked in a production environment with strong attention to maintainability and clean component architecture.",
      "challenge": "Marketing sites must be fast, accessible, and easy to maintain while supporting frequent content updates and consistent branding.",
      "solution": "Implemented reusable React components with TypeScript, maintained CSS Modules styling conventions, and supported SEO/performance improvements (routing, image optimization, code-splitting).",
      "impact": "Delivered a stable, scalable website foundation that supports ongoing marketing needs and provides a strong public presence for the brand.",
      "technologies": ["Next.js", "React", "TypeScript", "HTML", "CSS Modules", "SEO", "Performance Optimization"],
      "features": [
        "Reusable UI components",
        "Responsive, accessible layouts",
        "SEO-friendly pages",
        "Performance improvements",
        "Production maintenance & iteration"
      ],
      "projectImage": "/images/projects/Sofomo.svg",
      "projectLogo": "/images/projects/Sofomo.svg",
      "isPersonal": false,
      "showcaseOrder": 4
    },
    {
      "id": "triplepoint-qa",
      "company": "TriplePoint",
      "project": "Salesforce QA Automation",
      "visibility": "internal",
      "url": null,
      "location": "International",
      "startDate": "2023-01",
      "endDate": "2023-08",
      "role": "QA Engineer",
      "shortDescription": "Implemented Selenium-based QA automation with Jenkins CI and built a Next.js dashboard for non-technical test execution and reporting.",
      "longDescription": "Worked on QA automation for an internal Salesforce-based application. Created and maintained Selenium test suites, integrated automated runs with Jenkins, and supported a stable CI workflow. Built a lightweight Next.js interface that allowed non-technical users to trigger test runs and review Jenkins results, improving visibility and reducing manual QA coordination.",
      "challenge": "Non-technical stakeholders needed visibility and control over automated runs, and QA pipelines had to be stable and reproducible in CI.",
      "solution": "Implemented automated UI tests (Selenium/Java), configured Jenkins pipelines, and created a Next.js interface connected to Jenkins to run tests and surface outcomes in a simple, user-friendly way.",
      "impact": "Reduced manual QA coordination and improved transparency of automated test results for a broader group of stakeholders.",
      "technologies": ["Selenium", "Java", "Jenkins", "Salesforce", "Next.js", "CI/CD", "Test Automation", "QA"],
      "features": [
        "Selenium UI test suite",
        "Jenkins pipeline integration",
        "Self-service test execution UI",
        "Results visualization for stakeholders",
        "Regression coverage for critical flows"
      ],
      "projectImage": "/images/projects/triple-point-logo.png",
      "projectLogo": "/images/projects/triple-point-logo.png",
      "isPersonal": false,
      "showcaseOrder": 6
    },
    {
      "id": "flexcare-netsuite-vue",
      "company": "FlexCare",
      "project": "NetSuite CRM Front-end Application",
      "visibility": "internal",
      "url": null,
      "location": "United States",
      "startDate": "2023-08",
      "endDate": "2024-06",
      "role": "Lead Front-end Developer",
      "shortDescription": "Developed Vue.js modules deployed inside NetSuite to support employee time tracking and internal CRM workflows for a US healthcare staffing company.",
      "longDescription": "Built and extended front-end modules for FlexCare (US healthcare staffing), delivering a time-tracking and internal workflow UI deployed within the NetSuite environment. Focused on reliable day-to-day usability for operational teams, integrating with CRM processes and NetSuite data while working within platform constraints.",
      "challenge": "Operational users needed a simple, dependable interface, while NetSuite deployment and integration constraints limited the available tooling and patterns.",
      "solution": "Implemented Vue-based modules in JavaScript, integrated with CRM-related processes, and optimized UI flows to reduce manual effort for users. Kept the UI lightweight and aligned with business workflows.",
      "impact": "Improved efficiency of time entry and internal processes by providing a clearer, purpose-built UI inside NetSuite.",
      "technologies": ["Vue.js", "JavaScript", "NetSuite", "CRM Integration", "HTML", "CSS", "ERP Integrations"],
      "features": [
        "Time tracking UI flows",
        "NetSuite embedded deployment",
        "CRM/workflow integration",
        "User-friendly forms and validation",
        "Operational reliability"
      ],
      "projectImage": "/images/projects/FlexCare-logo.png",
      "projectLogo": "/images/projects/FlexCare-logo.png",
      "isPersonal": false,
      "showcaseOrder": 5
    },
    {
      "id": "proprio-netsuite-react-vue",
      "company": "Proprio",
      "project": "NetSuite Enhancements Platform",
      "visibility": "internal",
      "url": null,
      "location": "United States",
      "startDate": "2024-06",
      "endDate": "present",
      "role": "Front-end Developer",
      "shortDescription": "Built React and Vue front-end extensions for NetSuite ERP, delivering deployable UI modules that enhance native workflows.",
      "longDescription": "Developing standalone front-end modules in React and Vue that extend native NetSuite ERP functionality for US-based operations. Work includes building reusable UI components, managing complex state (Redux where needed), aligning with SuiteScript-backed flows, and ensuring smooth deployment and compatibility within NetSuite.",
      "challenge": "NetSuite imposes constraints on deployment, runtime, and integration patterns, requiring careful engineering to deliver modern UX without breaking compatibility.",
      "solution": "Developed reusable UI components, managed complex state (Redux where appropriate), integrated with NetSuite/SuiteScript flows, and ensured modules remained stable across deployments. Used Tailwind to keep UI consistent and fast to iterate.",
      "impact": "Delivered maintainable UI extensions that improved internal workflows and reduced friction for day-to-day NetSuite users.",
      "technologies": [
        "React",
        "Vue.js",
        "Redux",
        "TypeScript",
        "JavaScript",
        "NetSuite",
        "SuiteScript",
        "Tailwind CSS",
        "ERP Integrations"
      ],
      "features": [
        "NetSuite-deployable UI modules",
        "Reusable components",
        "State management patterns",
        "Integration with SuiteScript workflows",
        "Consistent Tailwind styling"
      ],
      "projectImage": "",
      "projectLogo": "",
      "isPersonal": false,
      "showcaseOrder": 3
    },
    {
      "id": "iqair-shopify-migration",
      "company": "IQAir",
      "project": "Headless Shopify E-commerce Platform",
      "visibility": "public",
      "url": "https://www.iqair.com/",
      "location": "United States",
      "startDate": "2025-01",
      "endDate": "2025-02",
      "role": "Front-end Developer",
      "shortDescription": "Built a headless Shopify storefront using React, Remix, and Hydrogen, integrating Shopify APIs and translating Liquid concepts into reusable components.",
      "longDescription": "Worked on a commercial headless commerce build in close cooperation with Shopify. Implemented a React-based storefront using Remix and Shopify Hydrogen, consuming Shopify APIs and translating Liquid-driven behaviors into reusable React components. Focused on performance, SEO-friendly routing, and maintainable patterns in a fast-moving e-commerce codebase. Added unit and component tests to improve stability during iterative development.",
      "challenge": "Traditional Liquid themes limited flexibility and performance tuning, while a headless approach required careful API modeling, SEO-friendly routing, and stable UI patterns under rapid iteration.",
      "solution": "Implemented Hydrogen/Remix routes and reusable React components, optimized data fetching, and introduced unit/component tests to reduce regressions. Styled consistently with Tailwind and maintained a developer-friendly setup via Vite.",
      "impact": "Improved maintainability and iteration speed for a production e-commerce storefront while keeping strong performance and SEO foundations.",
      "technologies": [
        "React",
        "Remix",
        "Shopify Hydrogen",
        "TypeScript",
        "Shopify API",
        "Liquid",
        "Tailwind CSS",
        "Vite",
        "React Testing Library",
        "Unit Testing",
        "Headless Commerce"
      ],
      "features": [
        "Headless storefront architecture",
        "Shopify API integration",
        "Reusable component patterns",
        "SEO-friendly routing & rendering",
        "Unit/component test coverage"
      ],
      "projectImage": "/images/projects/IQAir_logo.svg.png",
      "projectLogo": "/images/projects/IQAir_logo.svg.png",
      "isPersonal": false,
      "showcaseOrder": 1
    },
    {
      "id": "octopus-learning-platform",
      "company": "Octopus",
      "project": "English Learning Platform UI",
      "visibility": "public",
      "url": "https://www.octopus.study/ux/start",
      "location": "Poland / International",
      "startDate": "2024-06",
      "endDate": "2025-03",
      "role": "Lead Front-end Developer",
      "shortDescription": "Lead Front-end Developer for a UX/UI learning platform, owning front-end architecture and delivering a scalable Next.js + React UI.",
      "longDescription": "Octopus is a Poland-based learning platform for UX/UI professionals. As Lead Front-end Developer, I owned front-end architecture and implementation standards, partnering with design and product to ship a consistent, accessible UI. Built scalable components and pages in Next.js/React, improved performance for content-heavy views, and supported team delivery through code reviews and technical guidance.",
      "challenge": "The product required a consistent, accessible UI and strong performance on content-heavy pages, while supporting rapid iteration and multiple contributors.",
      "solution": "Designed a scalable component architecture, implemented key views in Next.js/React, and introduced conventions for code structure and review. Focused on performance, accessibility, and a consistent Tailwind-based UI system.",
      "impact": "Enabled faster feature delivery with a maintainable UI foundation, improved consistency across the product, and supported team productivity through clear front-end standards.",
      "technologies": [
        "Next.js",
        "React",
        "TypeScript",
        "Tailwind CSS",
        "HTML",
        "Front-end Architecture",
        "Performance Optimization",
        "Accessibility"
      ],
      "features": [
        "Scalable front-end architecture",
        "Design-system-like component reuse",
        "Performance improvements for content pages",
        "Accessibility-minded UI delivery",
        "Code reviews and technical leadership"
      ],
      "projectImage": "/images/projects/octopus-logo.svg",
      "projectLogo": "/images/projects/octopus-logo.svg",
      "isPersonal": false,
      "showcaseOrder": 2
    },
    {
      "id": "beautylash-website",
      "company": "BeautyLash",
      "project": "BeautyLash Salon Website",
      "visibility": "public",
      "url": "https://beautylash-83d09.web.app/",
      "location": "Poland",
      "startDate": "2020-06",
      "endDate": "2021-01",
      "role": "Front-end Developer",
      "shortDescription": "Commercial website for a beauty salon, built as an early React project with a focus on UI styling and client needs.",
      "longDescription": "BeautyLash was one of my first commercial front-end projects, created before starting my professional career. It was a website for an eyelash beautician salon, designed to present services, pricing, and contact information in a clean and visually appealing way. The project was built using React and styled-components, with a strong focus on layout, styling, and responsiveness. Although the original site is no longer live, a deployed version is available for preview purposes.",
      "challenge": "Designing and implementing a complete commercial website independently while learning React and modern styling approaches.",
      "solution": "Built a React-based application using styled-components and SCSS, focusing on reusable components, consistent styling, and a responsive layout tailored to the client’s business needs.",
      "impact": "Delivered a fully functional commercial website for a real client, gaining hands-on experience with client communication, project ownership, and modern front-end development fundamentals.",
      "technologies": ["React", "JavaScript", "Styled Components", "SCSS", "CSS", "Responsive Design"],
      "features": [
        "Service and pricing sections",
        "Responsive layout",
        "Custom styling with styled-components",
        "Client-focused content structure"
      ],
      "projectImage": "/images/projects/beautylash.png",
      "projectLogo": "/images/projects/beautylash.png",
      "isPersonal": true,
      "showcaseOrder": 7
    },
    {
      "id": "as-service-website",
      "company": "AS Serwis",
      "project": "AS Serwis Website",
      "visibility": "public",
      "url": "https://www.asserwis-kotly-krakow.pl/",
      "location": "Poland",
      "startDate": "2024-09",
      "endDate": "2024-12",
      "role": "Front-end Developer",
      "shortDescription": "Modern business website built with Next.js for a gas heating systems installer.",
      "longDescription": "AS Serwis is a modern business website created for a gas heating devices installer. The project focused on clarity, performance, and trust-building for a service-oriented business. Built with Next.js and TypeScript, the site emphasizes fast load times, SEO-friendly structure, and maintainable styling using CSS Modules. The application was deployed on Vercel and designed to be easily extendable as the business grows.",
      "challenge": "Creating a professional, trustworthy online presence for a technical service business while maintaining high performance and clean architecture.",
      "solution": "Implemented a Next.js application with TypeScript and CSS Modules, focusing on semantic structure, responsive design, and SEO best practices. Deployed using Vercel for reliability and fast delivery.",
      "impact": "Delivered a production-ready website that supports business visibility, improves client trust, and demonstrates modern front-end development practices.",
      "technologies": ["Next.js", "React", "TypeScript", "CSS Modules", "Vite", "Vercel", "SEO"],
      "features": [
        "SEO-friendly pages",
        "Responsive layout",
        "Clear service presentation",
        "Fast load times",
        "Production deployment on Vercel"
      ],
      "projectImage": "/images/projects/asservice.png",
      "projectLogo": "/images/projects/asservice.png",
      "isPersonal": true,
      "showcaseOrder": 8
    }
  ],
  "about": {
    "intro": "Front-end Developer with 4+ years of commercial experience building React and TypeScript applications—from headless Shopify e-commerce (Remix/Hydrogen) to enterprise NetSuite (React/Vue) extensions. Strong focus on performance, scalable UI architecture, maintainable code, and automated testing in international, cross-functional teams.",
    "previousCareer": {
      "title": "12+ Years in Hospitality Management",
      "description": "Before transitioning to tech, I built a successful career in the hotel industry spanning over 12 years. I held senior management positions where I was responsible for leading teams, managing operations, and delivering exceptional guest experiences at international properties.",
      "highlights": [
        "Managed teams of 20+ staff members across multiple departments",
        "Responsible for budgets, KPIs, and operational excellence",
        "Developed strong leadership, communication, and problem-solving skills",
        "Worked with diverse international teams and clientele"
      ],
      "skills": [
        "Team Leadership",
        "Project Management",
        "Client Relations",
        "Problem Solving",
        "Cross-functional Collaboration",
        "Stakeholder Management"
      ]
    },
    "journey": {
      "title": "My Transition into Tech",
      "description": "After 12+ years of building a successful career in hospitality management, I discovered my passion for coding and made a deliberate career change. The analytical thinking, problem-solving abilities, and people skills I developed as a manager translate directly into my work as a developer. What started as curiosity turned into a full commitment to mastering modern web technologies.",
      "highlights": [
        "Leveraged management experience to excel in collaborative development teams",
        "Made a career transition through intensive self-study and coding bootcamps",
        "Quickly progressed from fundamentals to advanced frameworks",
        "Now working with international clients on enterprise-level projects"
      ]
    },
    "education": [
      {
        "type": "degree",
        "title": "Master of Economics",
        "institution": "Cracow University of Economics",
        "description": "HR Management and Consulting. Dissertation focused on recruitment process mistakes and their impact on candidate selection.",
        "year": "2010 - 2013"
      },
      {
        "type": "degree",
        "title": "Bachelor of Economics",
        "institution": "Cracow University of Economics",
        "description": "International Economic Relations with a focus on finance. Dissertation on money laundering prevention strategies.",
        "year": "2006 - 2010"
      },
      {
        "type": "bootcamp",
        "title": "Full Stack Developer Bootcamp",
        "institution": "Codebrainers",
        "description": "420-hour intensive coding course covering Frontend and Backend technologies. Learned Python, SQL, JavaScript, HTML, CSS, and React in a small training group under experienced programmers.",
        "year": "2020 - 2021"
      },
      {
        "type": "course",
        "title": "React: Beginner to Advanced",
        "institution": "Eduweb",
        "description": "Comprehensive React learning path covering render props, propTypes, Styled Components, Redux, GSAP, Atomic Design, Storybook, and Context API.",
        "year": "2021"
      }
    ],
    "certifications": [
      {
        "name": "Update with your certification",
        "issuer": "Certification provider",
        "year": "Year"
      }
    ],
    "values": [
      {
        "title": "Code Quality & Performance",
        "description": "I build scalable, maintainable architectures with a focus on performance, SEO optimization, and automated testing to ship confidently.",
        "emphasized": false
      },
      {
        "title": "AI-Augmented Development",
        "description": "I actively integrate AI tools into my workflow to accelerate development, optimize code quality, and stay at the forefront of modern engineering practices.",
        "emphasized": true
      },
      {
        "title": "User-Centered Delivery",
        "description": "I translate UX into accessible, responsive interfaces that work reliably for real users and business workflows.",
        "emphasized": false
      }
    ]
  },
  "funFacts": [
    {
      "id": "skiing",
      "title": "Skiing Enthusiast",
      "description": "Hitting the slopes whenever I can. There's nothing like the thrill of carving through fresh powder in the mountains.",
      "icon": "mountain",
      "image": "/images/fun-facts/skiing.jpg"
    },
    {
      "id": "paddleboard",
      "title": "Stand-Up Paddleboarding",
      "description": "Finding balance both on the water and in code. SUP is my way to disconnect and recharge during summer.",
      "icon": "waves",
      "image": "/images/fun-facts/paddleboard.jpg"
    },
    {
      "id": "reading",
      "title": "Avid Reader",
      "description": "Always with a book in hand. From tech literature to fiction, reading expands my perspective and fuels creativity.",
      "icon": "book",
      "image": "/images/fun-facts/reading.jpg"
    },
    {
      "id": "coffee",
      "title": "Coffee Connoisseur",
      "description": "Debugging is powered by quality coffee. Exploring different roasts and brewing methods is a daily ritual.",
      "icon": "coffee",
      "image": "/images/fun-facts/coffee.jpg"
    }
  ]
}
